app/views/books/_form.html.erb

    <%= form.label :category_id %>
    <%= collection_select(:book, :category_id, Category.all, :id, :name, {}, { :multiple => false}) %>
---
SELECT "categories".* FROM "categories"