app/views/books/show.html.erb

SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."book_id" = ? ORDER BY "borrowings"."id" ASC LIMIT ?  [["book_id", 1], ["LIMIT", 1]]
SELECT "interests".* FROM "interests" WHERE "interests"."book_id" = ?  [["book_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---

<%= link_to_if (!@book.borrowing.nil? && @book.borrowing.user != current_user) || !@book.interests.empty?, 'Interest', book_interests_path(@book), method: :post%><br>
<%= link_to_if @book.interests.empty? && @book.borrowing.nil?, 'Borrow', transitions_path(:book_id => @book.id), method: :post%><br>

SELECT "interests".* FROM "interests" WHERE "interests"."book_id" = ?  [["book_id", 1]]
---
</p>
<% unless @book.interests.empty? %>