app/controllers/books_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "books" ("name", "author", "borrowed", "category_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Test"], ["author", "Guerrero"], ["borrowed", 0], ["category_id", 4], ["user_id", 1], ["created_at", "2020-05-13 20:11:44.061676"], ["updated_at", "2020-05-13 20:11:44.061676"]]
---
    def create
        @category = Category.first
        @book = Book.new(book_params)
        @book.category = @category
        @book.user = current_user
        @book.borrowed = false
        if @book.save