app/controllers/books_controller.rb

UPDATE "books" SET "category_id" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["category_id", 6], ["updated_at", "2020-05-15 16:01:44.001939"], ["id", 8]]
---
    def update
        @book = Book.find(params[:id])
        if (@book.update(book_params))