app/controllers/borrowings_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "interests".* FROM "interests" WHERE "interests"."book_id" = ? ORDER BY created_at ASC LIMIT ?  [["book_id", 2], ["LIMIT", 1]]
SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."book_id" = ? LIMIT ?  [["book_id", 5], ["LIMIT", 1]]
SELECT 1 AS one FROM "interests" WHERE "interests"."book_id" = ? LIMIT ?  [["book_id", 2], ["LIMIT", 1]]
SELECT "interests".* FROM "interests" WHERE "interests"."book_id" = ? ORDER BY created_at ASC LIMIT ?  [["book_id", 1], ["LIMIT", 1]]
DELETE FROM "borrowings" WHERE "borrowings"."id" = ?  [["id", 1]]
DELETE FROM "interests" WHERE "interests"."id" = ?  [["id", 3]]
INSERT INTO "borrowings" ("deadline", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["deadline", "2020-06-06 21:23:27.696890"], ["book_id", 5], ["user_id", 2], ["created_at", "2020-05-27 21:23:27.779806"], ["updated_at", "2020-05-27 21:23:27.779806"]]
UPDATE "books" SET "borrowed" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["borrowed", 1], ["updated_at", "2020-05-27 21:48:31.500423"], ["id", 1]]
---
    def create
        @book = Book.find(params[:book_id])
        if @book.borrowing.nil?
            @borrowing = Borrowing.new()
            @borrowing.book_id = @book.id
            @borrowing.deadline = DateTime.now()+10
            if @book.interests.empty?
                #Lista de interesse vazia
                @borrowing.user = current_user
            else
                #Pega o primeiro da lista de interesse
                @interest = @book.interests.order('created_at ASC').first
                @borrowing.user = @interest.user
                @interest.destroy
            end
            @book.borrowing = @borrowing
            @borrowing.save
            @book.borrowed = true
            @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "borrowed" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["borrowed", 0], ["updated_at", "2020-05-27 21:48:28.578560"], ["id", 1]]
DELETE FROM "borrowings" WHERE "borrowings"."id" = ?  [["id", 23]]
---
    def destroy
        @book = Book.find(params[:book_id])
        @book.borrowed = false
        @book.save
        @borrowing = @book.borrowing
        #Para testar, vamos sempre recriar o interesse após deletar o borrowing
        test_createInterest(@borrowing.user)
        #redirect_to book_path(@book)
        @borrowing.destroy

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "interests" ("book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 1], ["user_id", 2], ["created_at", "2020-05-27 20:57:45.249882"], ["updated_at", "2020-05-27 20:57:45.249882"]]
INSERT INTO "interests" ("book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 5], ["user_id", 2], ["created_at", "2020-05-27 21:36:53.203582"], ["updated_at", "2020-05-27 21:36:53.203582"]]
---
    def test_createInterest(user)
        @book = Book.find(params[:book_id])
        @interest = @book.interests.create()
        @interest.user = user
        @interest.save