app/controllers/dashboard_controller.rb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
    def load_my_books
        @my_books = current_user.books.limit(3)

SELECT "interests".* FROM "interests" WHERE "interests"."user_id" = ?  [["user_id", 2]]
---
    def load_my_interests
        @my_interests = current_user.interests.limit(3)