app/controllers/interests_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "interests" ("book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 11], ["user_id", 1], ["created_at", "2020-05-15 19:34:58.034897"], ["updated_at", "2020-05-15 19:34:58.034897"]]
---
    def create
        @book = Book.find(params[:book_id])
        if ((!@book.borrowing.nil? && @book.borrowing.user != current_user) ||
            (!@book.transition.nil? && @book.transition.newUser != current_user))
            #O usuário não está com o livro emprestado
            if (@book.user != current_user)
                #O usuário não é o dono do livro
                borrowings = current_user.interests.count + current_user.borrowings.count
                borrowings += current_user.myTransitions.count + current_user.transitions.count
                if (current_user.max_borrowings - borrowings > 0)
                    #O usuário ainda tem empréstimos disponíveis
                    @interest = @book.interests.create()

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "interests".* FROM "interests" WHERE "interests"."book_id" = ? AND "interests"."id" = ? LIMIT ?  [["book_id", 11], ["id", 1], ["LIMIT", 1]]
DELETE FROM "interests" WHERE "interests"."id" = ?  [["id", 1]]
---
    def destroy
        @book = Book.find(params[:book_id])
        @interest = @book.interests.find(params[:id])
        if (@interest.user == current_user)
            @interest.destroy